[
  {
    "articleCategory": "Nexstar Media Wire News",
    "articleTitle": "Man arrested after trying to open airplane door, stab United flight attendant in neck: prosecutors",
    "published_date": ["03/06/23"],
    "articleBody": "(NEXSTAR) – A Massachusetts man has been charged after authorities say he tried to open an emergency exit door, then attempted to stab a flight attendant repeatedly during a cross-country flight on Sunday. Francisco Severo Torres, 33, of Leominster, faces one count of “interference and attempted interference with flight crew members and attendants using a dangerous weapon,” according to a release from the U.S. Attorney’s Office. The flight crew got an alert just 45 minutes before the United flight from Los Angeles was set to touch down at Boston’s Logan International Airport that the door between first class and coach was disarmed, according to the release. An attendant reported finding the door’s locking handle moved a quarter-turn “out of the fully locked position,” and the lever arming the emergency slide “disarmed.” Another flight attendant said he had seen Torres near the door and believed he had tampered with it. The flight attendant notified the captain that Torres appeared to be a threat and that the plane should land as soon as possible, according to the release.  At one point, Torres left his seat and walked over to the two flight attendants, mouthing something unintelligible before he “thrust towards one of the flight attendants in a stabbing motion with a broken metal spoon, hitting the flight attendant on the neck area three times,” according to prosecutors. Passengers on the flight tackled Torres, the release states, and flight attendants helped detain him until they could turn him over to law enforcement upon landing. “Thanks to the quick action of our crew and customers, one customer was restrained after becoming a security concern on United flight 2609 from Los Angeles to Boston,” a United Airlines spokesperson told Nexstar in a statement. “The flight landed safely and was met by law enforcement.”  There were no serious injuries during the flight, the spokesperson added, and United is cooperating with the law enforcement investigation. “We have zero tolerance for any type of violence on our flights, and this customer will be banned from flying on United pending an investigation,” the statement read. During the pre-flight safety briefing, Torres allegedly asked another passenger where on the safety card he could find the door handle, fellow passengers later told investigators. The alleged incident was just the latest in a string of recent in-flight altercations. Between Jan. 1, 2022 and December 15, 2022, the Federal Aviation Administration investigated 823 reports of unruly behavior – down from 1099 the prior year but vastly more than in past years. The annual average from 2015-2020 was 131 incidents, according to the  . The charge Torres faces carries a maximum possible sentence of up to life in prison. Torres was detained on Monday and is awaiting a March 9 court appearance. ",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/03/GettyImages-1246152286.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "Administration",
    "articleTitle": "Jean-Pierre jokes about Marianne Williamson’s ‘aura,’ but ‘not tracking’ candidacy",
    "published_date": ["03/06/23"],
    "articleBody": "White House press secretary Karine Jean-Pierre joked Monday about Marianne Williamson’s ‘aura’ and said she is not tracking her candidacy after she became the first Democrat to challenge President Biden. Williamson, a spiritual adviser and author, formally launched her 2024 campaign on Saturday. She also ran as a Democrat for president in 2020 and among her proposals was to form a Department of Peace.  “I’m just not tracking that,” Jean-Pierre said when asked Monday if Biden is annoyed that she jumped in the race.  “I mean, if I had a, what is it called? A little globe here… a crystal ball that I can tell you. A magic eight ball, whatever. If I could feel her aura,” she added. “I just don’t have anything to share on that,” she said to laughter from the reporters in the briefing room. Jean-Pierre laughed and added, “Gosh, you guys are making me laugh now.” When Williamson ran in 2020, she polled in the single digits and dropped out of the Democratic primary before any votes were cast. Her candidacy comes as Democrats have largely fallen in line behind the president and with the party not clamoring for someone to take on Biden. Her candidacy has been met so far with   within the White House and the Democratic National Committee, along with eyerolls among political strategists. Biden has reiterated his intentions to run for reelection but has not yet officially launched his 2024 presidential campaign. ",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/02/AP20010121065149-e1676749834576.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "State Watch",
    "articleTitle": "The Memo: DeSantis finds foil in California ",
    "published_date": ["03/06/23"],
    "articleBody": "Florida Gov. Ron DeSantis (R) ventured into the belly of the liberal beast Sunday, hitting out at California while visiting the state.  DeSantis contended during a speech at the Ronald Reagan Presidential Library in Simi Valley, Calif., that the Golden State was “hemorrhaging population.”  This, he argued, was evidence that the “experiment” with progressive politics in one of the most liberal states in the nation was failing.  “The American people as a whole in some ways have voted about this experiment, because they voted with their feet,” DeSantis said. “And if you look over the last four years, we’ve witnessed a great American exodus from states governed by leftist politicians, imposing leftist ideology and delivering poor results.”   On one level, those remarks were the latest chapter in DeSantis’s ongoing political feud with California Gov. Gavin Newsom (D).  Last summer, Newsom, coasting to reelection, dropped some cash on a TV ad to run in Florida. The ad alleged that “freedom is under attack” by leaders like DeSantis, whom Newsom characterized as “banning books, making it harder to vote, restricting speech in classrooms, even criminalizing women and doctors.”  The Newsom ad called on disaffected Floridians to “join us in California.”  A DeSantis spokesperson at that time hit back by calling California “a hellhole” and Newsom’s ad “a pathetic smear.”  On Sunday, DeSantis began his remarks by noting drily, “your governor’s very concerned about what we’re doing in Florida, so I figured I had to come by.”  But DeSantis’s remarks were also emblematic of something broader than a row with just one governor.  Instead, they are part of a pattern in which the Golden State has become an inviting target for conservatives. For a significant share of the GOP grassroots, California has become synonymous with “wokeness,” high taxes, over-regulation, crime and homelessness.  “Look at the vast majority of elected officials in California —there’s a big blue ‘D’ after their name” said Tobe Berkovitz, a Boston University professor emeritus who specializes in political communication.   “Governor, senators, most of the congresspeople, most of the mayors — it is very blue, very liberal and, for Republicans, very filled with the problems that are endemic to liberal states.”  So far as voting behavior goes, that point is certainly true.  California has not backed a Republican for the White House since it voted for then-Vice President George H.W. Bush in 1988. President Biden carried the state by almost 30 points in 2020.  No Republican has won a Senate seat in California since Sen. Pete Wilson won reelection in 1988.   Wilson went on to become governor — where his name will be forever associated with Proposition 187, a ballot measure that passed in 1994. Proposition 187 pushed a harder line than previously on illegal immigration, holding that unauthorized immigrants should be blocked from most services provided through the state.  Though it passed, it never went fully into effect — and it is generally perceived as having done enormous harm to the GOP’s political fortunes in California by alienating Latino voters.  Some Democrats say Wilson’s stances were crucial in changing the political complexion of the state.  “When they got into the whole proposition wars on immigration, when Pete Wilson was governor, that was the pivot,” said California-based Democratic strategist Bill Carrick. “He sort of shifted the Republicans into a big-time anti-immigration message and Prop. 187 was scary to a lot of people in the state.”  Carrick also noted that the same shift has the perverse effect of making it easier for conservatives like DeSantis or former President Trump to attack California. Trump made a habit of jabbing at the state and its major cities, such as calling San Francisco “worse than a slum” at a 2020 rally.  In short, Carrick suggested, Republicans can’t really fare any worse in the Golden State, no matter what they say.  “They are so politically irrelevant in any general election, from president to statewide races to congressional races. So they have nothing to lose,” Carrick said, “You can beat up California because you don’t have any chance in hell of getting any Electoral College votes there. There is no political downside.”  It’s easy to forget these days that California produced two of the Republican presidents of the modern era, Reagan and President Nixon.   Potential presidential contenders like DeSantis seem to believe — perhaps rightly — that the state’s significant number of Republican voters don’t take attacks on the state personally.  Trump still received more than 6 million votes in California, even while suffering his 2020 drubbing, for example.  Above all, California has become a cultural touchstone of liberalism.  The state is, after all, not only home to former Speaker Nancy Pelosi (D) and a host of other liberal figureheads but to the entertainment industry and Silicon Valley.  As a conservative target, Berkovitz noted, “California gets bonus points for being the home to the liberal cultural machine, particularly Hollywood. So much of this battle is cultural as well as purely political.”  Given DeSantis’s appetite for fighting the culture wars on every possible issue, it’s little surprise that he has California in his sights.   ",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/03/d69856cc01f5441ca3451df0c135c58d.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "Opinion",
    "articleTitle": "The real-world barriers to electric vehicle infrastructure",
    "published_date": ["03/06/23"],
    "articleBody": "The federal government is providing billions of dollars to build out electric vehicle (EV) charging infrastructure, with a focus on investing in underserved communities. States — California in particular — have budgeted billions more. The money is in the system, so dramatic change is on the way, right? Not so fast. The challenges are immense and underestimated. California alone is home to 482 cities and 58 counties, each with different political structures, permitting requirements, staffing shortages and expertise gaps — not to mention different political and economic priorities and agendas.  My center at UC Berkeley, the Center for Law, Energy & Environment, is working with a small number of cities and communities to identify, understand and overcome the barriers to implementing EV infrastructure in underserved communities and share what we learn with other cities, state and federal governments, local communities and organizations working on these issues. When I worked as an adviser to former California Gov Jerry Brown (D), as difficult as it was to fund initiatives, as difficult as it was to pass legislation, the biggest challenge was almost always the actual implementation of the program. With the   program, which “empowers the communities most impacted by pollution to choose their own goals, strategies, and projects to reduce greenhouse gas emissions and local air pollution,” for example, it took months, sometimes even years, to work through the myriad of community and governmental challenges and implement the projects on the ground. Here’s a small taste of some of the issues just for EV infrastructure. Residents of underserved communities often live in multi-family buildings rather than single-family homes. For buildings with parking lots, should chargers be added to parking spaces? How many? What are the access rules? Who can park in those spaces? What is the fee structure? How is the electricity provided? What are the rates? If buildings lack dedicated parking and chargers are located at the curb for curbside parking, what are the permitting rules? What are the Americans with Disabilities Act requirements? Who is responsible for the upkeep of the chargers? How do cities limit vandalism? What is the mix of fast chargers and slow? Most importantly, how do cities ensure that communities have a say and benefit from the changes that new infrastructure will bring? Should chargers be located near homes, parks, commercial strips? What are times of operation? Should the focus be on car ownership? What about other transportation options, like shared use, or vanpools, or e-bikes, or scooters? Almost certainly, there are solutions to all these issues. One initial step is to work with communities to build maps that identify the locations of parking lots, churches and businesses where chargers might be located; electricity usage, demand and constraint information; transportation routes and high usage corridors; public transit routes and nodes; building type and location; existing sources of pollution; as well as community amenities like parks and walking routes. Cities that map these criteria and work with communities to identify priorities to inform EV infrastructure design and locations will be the ones that get the most utilization and community benefit.  But solutions take time and money. The scope and extent of barriers, and the comparative lack of resources allocated to overcoming those barriers, constitutes perhaps the biggest hurdle not just for EV infrastructure, but for virtually every aspect of the energy and transportation transitions needed in the face of climate change.  So far, of the billions of dollars allocated by government, only a very small portion is dedicated to increasing the capacity of cities to do the planning and implementation essential to success, or of community-based organizations working on the nitty gritty, less-than-exciting elements of actual success.  Philanthropy could help bridge this enormously important gap, but that would take a change in perspective and priorities. Most philanthropic funding is project-focused, supporting organizations’ work on particular initiatives or on achieving policy wins, rarely on the nuts and bolts of how governments or communities implement action and work through local power dynamics, leadership vacuums, permitting disputes, mapping exercises, jurisdictional dilemmas, community disagreements, ADA requirements, energy rate setting, facility access, as well as myriad other issues that stand between billions of dollars of funding and community transformation.  Local governments and community-based organizations need help with this. It can start with recognition of the challenge and the need. The federal funding for infrastructure is dramatic and potentially community, city, state and country changing, but it will be for naught if we do not improve and expand our ability to implement solutions in the face of the many barriers to implementation. ",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/01/6dfcc94dc5f54354bdc6f184e62b9d8e-e1674683988477.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "House",
    "articleTitle": "Jordan issues subpoenas over school boards memo, DHS disinformation board",
    "published_date": ["03/06/23"],
    "articleBody": "The House Judiciary Committee on Monday issued three subpoenas in an effort to forge ahead on two of its most controversial probes. The panel sent subpoenas to two figures previously connected with the National School Boards Association (NSBA), part of its ongoing investigation into a   encouraging the FBI to coordinate with school boards amid rising violent threats to its members. A third subpoena was sent to Nina Jankowicz, who briefly served as the head of the Department of Homeland Security’s Disinformation Governance Board, which was swiftly disbanded amid Republican criticism. Chair Jim Jordan (R-Ohio) has cast the 2021 school board memo as an “anti-parent directive” and has claimed without evidence that the NSBA coordinated with the White House as part of a “pretext to go after parents.” The board sent a letter to the White House the week before the memo was released, laying out a spate of incidents at recent school board meetings, noting that some threats “could be the equivalent to a form of domestic terrorism and hate crimes.”  The initial letter from the National School Boards Association references a meeting with the White House and the Department of Education and asks for the Justice Department to review whether the threats may violate a number of different federal laws. The Justice Department memo fell far short of what the group was asking for, however, stressing “coordination and partnership” with local law enforcement over any legal review. The ensuing political storm caused the National School Boards Association to issue a statement saying its members “regret and apologize for the letter.” While Jordan has said the policy has a chilling effect on free speech, a D.C.-based federal judge in September dismissed a suit from parents in Michigan and Virginia, saying the memo does not impact constitutionally protected conduct. The subpoenas were sent to Viola Garcia, who is now the group’s treasurer-secretary, and Chip Slaven, the former interim executive director of the NSBA who is no longer with the organization. The board did not immediately respond to a request for comment. Jankowicz, a disinformation expert who has worked throughout Eastern Europe, was hired to lead a newly created DHS Disinformation Governance Board that would help its different agencies in dealing with disinformation on topics as varied as migration to addressing plots from Russia and Iran.   But Republicans   as the “Ministry of Truth” in a nod to George Orwell’s novel “1984” and couched it as a government effort to control speech. DHS   of the board just three weeks after it was announced, indicating the group never even formally met. Jankowicz is in the midst of fundraising to sue Fox News over the way the board was covered by the outlet, claiming they made “over 500 scaremongering statements about my role, my views, and my personal life over the next nine months.” In a Go Fund Me post, Jankowicz said misinformation about her role began as soon as her April hiring “even though the Board had nothing to do with arbitrating or restricting speech.”  Reached for comment, Jankowicz said she “will not be cowed by conspiracy theories or intimidation.” “Under Jim Jordan, the abuse of congressional oversight powers is about to get wildly out of control. His ‘weaponization’ committee is the entity that is actually weaponizing our government, and the American people deserve better,” she said. “I will happily testify to the truth of the Board under oath: That it was a working group meant to address disinformation that endangered Americans’ safety, and — because of the Republican Party’s irresponsible lies about it — our democracy is less secure.”",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/02/jordanjim_020823ag_w.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "Opinion",
    "articleTitle": "DeSantis doesn’t make sense for friends of freedom",
    "published_date": ["03/06/23"],
    "articleBody": "Florida Gov. Ron DeSantis (R) — a candidate well known for his support of   — started   with a   rich with irony. His book, “ ,” comes from a politician   supported and signed laws   from talking about Black history and high school students from getting advanced college credit for a course in Black Studies. A much more appropriate title for his book that would reflect his policies would be, “Fear of Freedom.” During the height of the threat to freedom in the censorship hysteria wrought by GOP Sen. Joe McCarthy in the 1950s, moderate Republican President Dwight Eisenhower gave a speech at Dartmouth University with the title “Don’t Join the Book Burners.” DeSantis may not be burning books, but he is burning bridges that would connect him to millions of voters who believe in a just multi-racial society. Adding to the paradox of his quest for the presidency, he started his tour on the last day of Black History Month and extended it through the first week of Women’s History Month, which is awkward since the governor apparently   or a  Every presidential campaign needs a theme song, as well as a book tour. Franklin Roosevelt’s signature music was “Happy Days are Here Again.” DeSantis should use the signature song “Those Were the Days” from the sitcom “All in The Family.” Archie Bunker’s archaic take on the times —“A guy like me had it made” and “Girls were girls and men were men” — was played for laughs. It seems DeSantis is dead serious about rolling back the clock. Archie Bunker is the protype Republican voter, while the show’s the young couple, Mike and Gloria Stivic, and “The Jeffersons” are friendly to Democrats. The Florida governor pitches his politics and policies to dependable GOP voters, the white men and senior citizens who fear the changes that are transforming America from a bastion of white power into a minority-majority nation. But DeSantis and like-minded Republicans will learn the hard way that you can slow change down, but you can’t stop it. The   has estimated that the United States will be minority white by 2045. That means children born this year will live in a minority majority population by the time they graduate from college. DeSantis rails against “woke ideology” — social justice and equality — while America changes complexion. Politicians should lead the charge against the turmoil that comes from the transition to multi racial society, not provoke it like DeSantis does. The great Spanish philosopher George Santayana likely had people like the governor in mind when he wrote “Those who don’t remember the past are condemned to repeat it.” The failure to teach young people about violence against African Americans is an engraved invitation to relive it. The governor’s support for censorship extends way beyond race. In Florida,   if they teach young students. He used his political power to punish the   for what he calls “trying to inject woke ideology” into its programming. DeSantis’ strict and authoritarian policies in Florida would be pretty scary stuff at the national level. DeSantis is the GOP presidential candidate that Democrats should fear as much or more as Donald Trump. Trump and DeSantis share many of the same policy positions, but the governor is smoother and less threatening personally than the failed former president. DeSantis has a military background, a stable and attractive family, as well as an Ivy League education. His youth offers a clear contrast to his toughest opponents, Trump and Joe Biden. DeSantis has won two gubernatorial terms of one of the biggest states in the union, In his successful bid for reelection last year, he won the support of   and residents of Miami-Dade County, home to Miami and its suburbs. There aren’t many Republicans with those kinds of political credentials. Polls show that Trump tops the  , but the Florida governor is a serious threat to win the nomination. Many prominent Republicans are looking for a fresh face to replace Trump, who weighs down the GOP with enough baggage for a yearlong international tour. DeSantis doesn’t make sense for real friends of freedom. President Biden has moved mountains to bring   have long enjoyed since the founding of our great nation. In contrast, it seems DeSantis would only further marginalize minorities, which is the last thing we need in a society that is changing color right before our eyes.",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/01/AP21271729662135.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "Business",
    "articleTitle": "DOJ moving to block JetBlue-Spirit airline merger: reports",
    "published_date": ["03/06/23"],
    "articleBody": "The Biden administration will attempt to block the $3.8 billion JetBlue acquisition of Spirit Airlines, which has faced criticism over possible antitrust violations, according to reports. Both the Justice Department and the Transportation Department are expected to begin proceedings to block the takeover,   and  , citing people familiar with the case.  Justice officials are expected to file an antitrust suit arguing that the JetBlue takeover of Spirit would eliminate flight choices for consumers and increase ticket prices, according to Bloomberg. The Transportation Department is expected to launch a simultaneous motion to also block the deal. The purchase of Spirit by JetBlue was approved by shareholders last October. The federal government action is expected to delay and potentially derail the acquisition, which must be closed by early 2024. The Biden administration has made improving consumer experience with airlines a priority, with widespread flight delays and a string of close-calls between aircraft making national headlines in recent months. The federal government, particularly Transportation Secretary Pete Buttigieg, has faced immense scrutiny over its handling of the incidents. JetBlue released a statement on Monday defending the purchase, arguing the merger would push competitor fares down and that the two airlines primarily compete against other airlines and not each other. The Justice Department and Transportation Department did not immediately respond to a request for comment.",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/11/AP21077751181618.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "Energy & Environment",
    "articleTitle": "Norfolk Southern to provide financing for temporary relocation during soil cleanup",
    "published_date": ["03/06/23"],
    "articleBody": "Norfolk Southern will pay for temporary relocation for people who live within a mile of the site of a train derailment that spilled hazardous chemicals, amid ongoing cleanup efforts.  The Environmental Protection Agency (EPA) said in a Sunday   that the company will provide “additional financial assistance” that may include “ temporary lodging, travel, food, clothing, and other necessities.” The update comes as “some residents close to the derailment site may notice additional odors” while work is being done on the soil there. The EPA also said that the payment is coming at its request.  Local organizers said that they were glad to hear about the assistance, but that more needs to be done. “This helps our short-term problem, but we will need longer-term relocation options, independent environmental testing, ongoing health monitoring, and safe disposal of the toxic waste,” Daniel Winston, co-executive director of local group River Valley Organizing. said in a written statement. Asked about the latest update, a company spokesperson said it was working on removing tracks and excavating the soil underneath.  The company said it is using “additional air monitors” and will continue to monitor area water as well.  A Norfolk Southern train carrying materials including the carcinogen vinyl chloride derailed last month. Officials have said that it is safe for residents to be in the area, but community members have expressed concerns about their health.",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/02/OhioTrain_020623_AP_Gene-J-Puskar.jpg?w=2000&amp;ssl=1\"/>"
  },
  {
    "articleCategory": "International",
    "articleTitle": "Mexico finds 343 migrants, 103 unaccompanied minors in abandoned trailer",
    "published_date": ["03/06/23"],
    "articleBody": "Mexican authorities said Monday that 343 migrants, including 103 unaccompanied minors, were found in a trailer abandoned on a highway in Veracruz.  Among those found in the trailer Sunday night along the Cosamaloapan-La Tinaja highway were migrants from Guatemala, Honduras, El Salvador and Ecuador, Mexico’s National Institute of Migration (INM)  . Most of the minors reportedly hailed from Guatemala. The hundreds of migrants were found alive, according to authorities, and the trailer transporting them notably had fans and vents for air circulation in the container, which had a double-layer metal structure. INM also said the migrants wore “colored bracelets” as identifiers.  The unaccompanied children will be under the care of the Veracruz family services system, while the adults will be processed through Mexico’s immigration system.  Fifty migrants were   last summer in a tractor-trailer near San Antonio, Texas, in a tragedy that added to ongoing concerns about   and   in the Americas.   ",
    "imageLink": "<img src=\"https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2023/03/mexico_AP.jpg?w=2000&amp;ssl=1\"/>"
  }
]
